3B/CS486/11-Inference-and-Sampling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-27 Wed 10:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Inference And Sampling</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Inference And Sampling</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc6b6302">1. Hidden Markov Models</a>
<ul>
<li><a href="#org3d13303">1.1. Belief Monitoring</a>
<ul>
<li><a href="#orga115b8b">1.1.1. Forward</a></li>
<li><a href="#orgddb524d">1.1.2. Backward</a></li>
<li><a href="#orgbf6a07a">1.1.3. Forward-Backward</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org468208c">2. Dynamic Bayesian Networks</a></li>
<li><a href="#org018c2bf">3. Sampling</a>
<ul>
<li><a href="#org0be32da">3.1. Forward Sampling</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgc6b6302" class="outline-2">
<h2 id="orgc6b6302"><span class="section-number-2">1.</span> Hidden Markov Models</h2>
<div class="outline-text-2" id="text-1">
<p>
A node may repeat over time, so this requires an explicit encoding of time.
A chain has a length equal to the amount of time modeled.
Times can be <b>event-driven</b> or <b>clock-driven</b>.
</p>

<p>
The <b>Markov assumption</b>
\[ P(S_{t+1} \mid S_{1}, \dots, S_{t}) = P(S_{t+1} \mid S_{t}) \]
gives the dynamics of the Markov chain.
</p>

<p>
In a <b>Hidden Markov Model (HMM)</b> observations \(O_{t}\) and observation
functions \(P(O_{t} \mid S_{t})\) are added to the states.
The observations are always observed, so their nodes are square.
</p>

<p>
Given a sequence of observations \(O_{1}, \dots, O_{t}\), the following
can be estimated:
\[ P(S_{t} \mid O_{1}, \dots, O_{t}) \]
and
\[ P(S_{k} \mid O_{1}, \dots, O_{k}) \; \text{for $k < t$} \]
</p>

<p>
The most well-known application of HMMs is in speech recognition.
These can be built in a hierarchical model, with higher-level models
having words as states to built sentences as HMMs and lower-level
models having phonemes as states to have words as HMMs.
Observations are generally audio features, with different
levels of granularity of audio features being present in different
levels of models.
</p>
</div>
<div id="outline-container-org3d13303" class="outline-3">
<h3 id="org3d13303"><span class="section-number-3">1.1.</span> Belief Monitoring</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orga115b8b" class="outline-4">
<h4 id="orga115b8b"><span class="section-number-4">1.1.1.</span> Forward</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
\[ \alpha_{t} (i) = P(O_{1 \dots t}, S_{t} = i) = P(O_{t} \mid S_{t} = i) \sum_{S_{t-1}} P(S_{t} = i \mid s_{t-1}) \alpha_{t-1}(s_{t-1}) \]
</p>
</div>
</div>
<div id="outline-container-orgddb524d" class="outline-4">
<h4 id="orgddb524d"><span class="section-number-4">1.1.2.</span> Backward</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
\[ \beta_{t}(i) = P(O_{t+1 \dots T} \mid S_{t} = i) = \sum_{s_{t+1}} \beta_{t+1} (s_{t+1}) P(O_{t+1} \mid s_{t+1}) P(s_{t+1} \mid S_{t} = i) \]
</p>
</div>
</div>
<div id="outline-container-orgbf6a07a" class="outline-4">
<h4 id="orgbf6a07a"><span class="section-number-4">1.1.3.</span> Forward-Backward</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
\[ \alpha_{t}(i) \beta_{t}(i) = P(O_{1 \dots T}, S_{t} = i) \propto P(S_{t} = i \mid O) \]
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org468208c" class="outline-2">
<h2 id="org468208c"><span class="section-number-2">2.</span> Dynamic Bayesian Networks</h2>
<div class="outline-text-2" id="text-2">
<p>
Any Bayesian network can repeat over time, which is a <b>Dynamic Bayesian Network</b>.
Many examples can be solved with variable elimination though they can become too complex with
enough variables.
</p>

<p>
Bayesian probability ensures that evidence is integrated proportionally to its precision,
so sensors are <b>precision weighted</b>.
</p>

<p>
Variable elimination is an exact algorithm, and sometimes these calculations can be difficult
or probability distributions are unknown.
This requires resorting to stochastic sampling, since sampling from a distribution allows
for estimation.
</p>
</div>
</div>
<div id="outline-container-org018c2bf" class="outline-2">
<h2 id="org018c2bf"><span class="section-number-2">3.</span> Sampling</h2>
<div class="outline-text-2" id="text-3">
<p>
With <b>stochastic simulation</b>, get probabilities from samples.
Specifically, sample from a variable&rsquo;s posterior probability to estimate its posterior
probability.
</p>

<p>
To generate samples from a distribution for a variable \(X\) with a discrete domain or a real
domain:
</p>
<ul class="org-ul">
<li>totally order values of the domain of \(X\)</li>
<li>generate the cumulative probability distribution \(f(x) = P(X \le x)\)</li>
<li>select a value \(y\) uniformly in the range \([0, 1]\)</li>
<li>select the \(x\) such that \(f(x) = y\)</li>
</ul>
</div>
<div id="outline-container-org0be32da" class="outline-3">
<h3 id="org0be32da"><span class="section-number-3">3.1.</span> Forward Sampling</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Sample variables one at a time, specifically sampling parents before sampling a node.
Given values for the parents of \(X\), sample from the probability of \(X\) given its parents.
</p>

<p>
For samples \(s_{i}\), \(i = 1 \dots N\)
\[ P(X = x_{i}) \propto \sum_{s_{i}} \delta (x_{i}) = N_{X=x_{i}} \]
where \(\delta(x_{i})\) is 1 if \(X = x_{i}\) in \(s_{i}\) and 0 otherwise.
</p>

<p>
Inference via sampling approaches the probability as the number of samples increases.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-11-27 Wed 10:19</p>
</div>
</body>
</html>
